; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_5_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 - counter
	)
  (:init
		(= (value c0) 40)
	(= (value c1) 42)
	(= (value c2) 9)
	(= (value c3) 94)
	(= (value c4) 76)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
		)
	)
)

; plan
1. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 2 of 4
2. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 2 of 4
3. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 2 of 4
4. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 2 of 4
5. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 2 of 4
6. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 2 of 4
7. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 2 of 4
8. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 2 of 4
9. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 2 of 4
10. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 2 of 4
11. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 2 of 4
12. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 2 of 4
13. (increment c4)
   changed: (value c4) from 76 to 81
   goals met: 2 of 4
14. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 2 of 4
15. (increment c4)
   changed: (value c4) from 81 to 87
   goals met: 2 of 4
16. (increment c4)
   changed: (value c4) from 87 to 93
   goals met: 2 of 4
17. (increment c4)
   changed: (value c4) from 93 to 99
   goals met: 3 of 4
18. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 3 of 4
19. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 3 of 4
20. (increment c2)
   changed: (value c2) from 9 to 16
   goals met: 3 of 4
21. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 3 of 4
22. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 3 of 4
23. (increment c2)
   changed: (value c2) from 16 to 23
   goals met: 3 of 4
24. (increment c2)
   changed: (value c2) from 23 to 30
   goals met: 3 of 4
25. (increment c2)
   changed: (value c2) from 30 to 37
   goals met: 3 of 4
26. (increment c2)
   changed: (value c2) from 37 to 44
   goals met: 4 of 4
